---
kind: other
id: Methods.T:Autodesk.Revit.DB.IExternalResourceServer
source: html/1ae135e5-2421-f0ad-0bf1-2ba2d5c43c79.htm
---
# IExternalResourceServer Methods

Implement this method to indicate whether two given resources are the same.